# Exploratory  Data

In [14]:
import pandas as pd

In [15]:
df = pd.read_csv('seller_dataset.csv')

In [16]:
df.describe(include=object)
#string values

                               seller_id     seller_city seller_state
count                               3095            3095         3095
unique                              3095             389           34
top     3442f8959a84dea7ee197c632cb2df15  KOTA TANGERANG       BANTEN
freq                                   1             694          841

In [17]:
df.describe()
#the only numeric values

       seller_zip_code
count      3095.000000
mean      32291.059451
std       32713.453830
min        1001.000000
25%        7093.500000
50%       14940.000000
75%       64552.500000
max       99730.000000

In [18]:
df.head()

,seller_id,seller_zip_code,seller_city,seller_state
0,3442f8959a84dea7ee197c632cb2df15,13023,KOTA JAKARTA TIMUR,DKI JAKARTA
1,d1b65fc7debc3361ea86b5f14c68d2e2,13844,KOTA PADANG PANJANG,SUMATERA BARAT
2,ce3ad9de960102d0677a81f5d0bb7b2d,20031,KOTA JAKARTA BARAT,DKI JAKARTA
3,c0f3eea2e14555b6faeea3dd58c1b1c3,4195,KOTA TANGERANG,BANTEN
4,51a04a8a6bdcb23deccc82b0b80742cf,12914,KABUPATEN LAMONGAN,JAWA TIMUR

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df.shape
# (rows,columns)

(3095, 4)

In [21]:
len(df)
#number of rows

3095

In [22]:
df.tail()

,seller_id,seller_zip_code,seller_city,seller_state
3090,98dddbc4601dd4443ca174359b237166,87111,KABUPATEN HULU SUNGAI TENGAH,KALIMANTAN SELATAN
3091,f8201cab383e484733266d1906e2fdfa,88137,KABUPATEN KOTAWARINGIN TIMUR,KALIMANTAN TENGAH
3092,74871d19219c7d518d0090283e03c137,4650,KOTA TANGERANG,BANTEN
3093,e603cf3fec55f8697c9059638d6c8eb5,96080,KABUPATEN GROBOGAN,JAWA TENGAH
3094,9e25199f6ef7e7c347120ff175652c3b,12051,KOTA KEDIRI,JAWA TIMUR

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3095 entries, 0 to 3094
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   seller_id        3095 non-null   object
 1   seller_zip_code  3095 non-null   int64
 2   seller_city      3095 non-null   object
 3   seller_state     3095 non-null   object
dtypes: int64(1), object(3)
memory usage: 96.8+ KB

In [11]:
df.notnull()

      seller_id  seller_zip_code  seller_city  seller_state
0          True             True         True          True
1          True             True         True          True
2          True             True         True          True
3          True             True         True          True
4          True             True         True          True
...         ...              ...          ...           ...
3090       True             True         True          True
3091       True             True         True          True
3092       True             True         True          True
3093       True             True         True          True
3094       True             True         True          True

[3095 rows x 4 columns]

# Data Transformation

In [13]:
# length of cell i user_name column
len(df.at[0, 'seller_id'])

32

In [24]:
# Convert the 'seller_id' ,seller_city,user_state column from object to string
df['seller_id'] = df['seller_id'].astype("string")
df['seller_city'] = df['seller_city'].astype("string")
df['seller_state'] = df['seller_state'].astype("string")

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3095 entries, 0 to 3094
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   seller_id        3095 non-null   string
 1   seller_zip_code  3095 non-null   int64
 2   seller_city      3095 non-null   string
 3   seller_state     3095 non-null   string
dtypes: int64(1), string(3)
memory usage: 96.8 KB

In [26]:
# Export the DataFrame to a CSV file
df.to_csv('seller_dataset_1.csv', index=False)

In [27]:
df1 = pd.read_csv('seller_dataset_1.csv')

In [28]:
df1.head()

,seller_id,seller_zip_code,seller_city,seller_state
0,3442f8959a84dea7ee197c632cb2df15,13023,KOTA JAKARTA TIMUR,DKI JAKARTA
1,d1b65fc7debc3361ea86b5f14c68d2e2,13844,KOTA PADANG PANJANG,SUMATERA BARAT
2,ce3ad9de960102d0677a81f5d0bb7b2d,20031,KOTA JAKARTA BARAT,DKI JAKARTA
3,c0f3eea2e14555b6faeea3dd58c1b1c3,4195,KOTA TANGERANG,BANTEN
4,51a04a8a6bdcb23deccc82b0b80742cf,12914,KABUPATEN LAMONGAN,JAWA TIMUR